ryanmr/ekami/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# WiFi
CONFIG_ESP_WIFI_SSID=""
CONFIG_ESP_WIFI_PASSWORD=""

# HTTP client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Fonts - embed key sizes for the badge
CONFIG_FONT16_EMBEDDED=y
CONFIG_FONT18_EMBEDDED=y
CONFIG_FONT24_EMBEDDED=y
CONFIG_FONT48_EMBEDDED=y
CONFIG_FONT_ENABLE_TFCARD=y
CONFIG_FONT_ENABLE_SDCARD=y

# Images
CONFIG_IMG_SOURCE_EMBEDDED=y
